Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_eth.cpp
//Source: https://github.com/eldarkg/emdr1986x-std-per-lib

/**
  * FILE MDR32F9Qx_eth.c
  */

// Modified in 2024 by Yuri Denisov for AQUARIUS_Arduino_Core_Rudiron_MDR32F9Qx

#define Aquarius

#if defined(Aquarius)
#define HelloString "Rudiron System Aquarius! Welcome!"
#define HelloStringLength 33
#else
#define HelloString "Welcome!"
#define HelloStringLength 8
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32F9Qx_config.h"
#include "MDR32F9Qx_dma.h"
#include "MDR32F9Qx_eth.h"
#include "MDR32F9Qx_rst_clk.h"

#include <math.h>
#include <stdio.h>

#define ASSERT_INFO_FILE_ID FILEID__MDR32F9X_ETH_C


/** @addtogroup __MDR32F9Qx_StdPeriph_Driver MDR32F9Qx Standard Peripherial Driver
  * @{
  */

/** @defgroup ETHERNET ETHERNET
 *  @warning This module can be used only for microcontrollers MDR1986VE1T and MDR1986VE3.
  * @{
  */

#if defined (USE_MDR1986VE1T) || defined (USE_MDR1986VE3)

/** @defgroup ETH_Exported_Variables ETH Exported Variables
 *  @{
 */
extern DMA_CtrlDataTypeDef DMA_ControlTable[DMA_Channels_Number * (1 + DMA_AlternateData)];
/** @} */ /* End of group ETH_Exported_Variables */

/** @defgroup ETH_Private_Defines ETH Private Defines
  * @{
  */

#if defined (USE_MDR1986VE3)
	#define IS_ETH_ALL_PERIPH(PERIPH)				((PERIPH == MDR_ETHERNET1) ||\
																					 (PERIPH == MDR_ETHERNET2))
#elif defined (USE_MDR1986VE1T)
	#define IS_ETH_ALL_PERIPH(PERIPH)				(PERIPH == MDR_ETHERNET1)
#endif
#define IS_ETH_PHY_ADDRESS(ADDRESS)				(((ADDRESS << ETH_PHY_CONTROL_PHYADD_Pos) & (~ETH_PHY_CONTROL_PHYADD_Msk)) == 0)
#define IS_ETH_COL_WND(WND)						(WND <= 0xFF)
#define IS_ETH_RETRY_COUNTER(COUNTER)			(COUNTER <= 0x0F)
#define IS_ETH_DELIMITER(DELIMITER)				((DELIMITER >= 0x5EA) && (DELIMITER <= 0x1A16))

#define ETH_BUFFER_SIZE							((uint32_t)0x2000)

/** @} */ /* End of group ETH_Private_Defines */

/** @defgroup ETH_Private_Macros ETH Private Macros
  * @{
  */
/** @} */ /* End of group ETH_Private_Macros */

/** @defgroup ETH_Private_Variables ETH Private Variables
  * @{
  */

/** @} */ /* End of group ETH_Private_Variables */

/** @defgroup ETH_Private_FunctionPrototypes ETH Private FunctionPrototypes
  * @{
  */
/** @} */ /* End of group ETH_Private_FunctionPrototypes */

/** @defgroup ETH_Private_Functions ETH Private Functions
  * @{
  */

/**
  * @brief	Reset the ETHERNET clock registers to their default reset values.
  * @param	None
  * @retval	None
  */
void ETH_ClockDeInit(void)
{
	uint32_t tmpreg_ETH_CLOCK;

	/* Read old value */
	tmpreg_ETH_CLOCK = MDR_RST_CLK->ETH_CLOCK;

	/* Reset all settings for Ethernet and PHY */
	tmpreg_ETH_CLOCK &= ~(RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk |
						  RST_CLK_ETH_CLOCK_ETH2_CLK_EN |
						  RST_CLK_ETH_CLOCK_PHY_CLK_EN |
						  RST_CLK_ETH_CLOCK_ETH_CLK_EN |
						  RST_CLK_ETH_CLOCK_ETH_BRG_Msk |
						  RST_CLK_ETH_CLOCK_PHY_BRG_Msk);
	/* Save new value */
	MDR_RST_CLK->ETH_CLOCK = tmpreg_ETH_CLOCK;
}

/**
  * @brief	Config the PHY clock register.
  * @param	clock_source: defines the frequency source for the PHY.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_PHY_CLOCK_SOURCE_HSI
  * 			@arg ETH_PHY_CLOCK_SOURCE_HSE
  * 			@arg ETH_PHY_CLOCK_SOURCE_PLLCPU_0
  * 			@arg ETH_PHY_CLOCK_SOURCE_HSE2
  * @param	PHY_HCLKdiv: specifies the HCLK division factor.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_PHY_HCLKdiv1
  * 			@arg ETH_PHY_HCLKdiv2
  * 			@arg ETH_PHY_HCLKdiv4
  * 			@arg ETH_PHY_HCLKdiv8
  * 			@arg ETH_PHY_HCLKdiv16
  * 			@arg ETH_PHY_HCLKdiv32
  * 			@arg ETH_PHY_HCLKdiv64
  * 			@arg ETH_PHY_HCLKdiv128
  * @retval	None
  */
void ETH_PHY_ClockConfig(uint32_t clock_source, uint32_t PHY_HCLKdiv)
{
	uint32_t tmpreg_ETH_CLOCK;

	/* Check the parameters */
	assert_param(IS_ETH_CLOCK_SOURCE(clock_source));
	assert_param(IS_ETH_PHY_HCLKdiv(PHY_HCLKdiv));

	tmpreg_ETH_CLOCK = MDR_RST_CLK->ETH_CLOCK;
	tmpreg_ETH_CLOCK &= ~ (RST_CLK_ETH_CLOCK_PHY_BRG_Msk | RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk);

	/* Select clock source for PHY module and set PHY DIV */
	tmpreg_ETH_CLOCK |= clock_source | PHY_HCLKdiv;
	/* Enable PHY CLK */
	tmpreg_ETH_CLOCK |= RST_CLK_ETH_CLOCK_PHY_CLK_EN;

	MDR_RST_CLK->ETH_CLOCK = tmpreg_ETH_CLOCK;
}

/**
  * @brief	Initializes the ETHERNET peripheral Clock according to the
  *         specified parameters.
  * @param	ETH_HCLKdiv: specifies the HCLK division factor.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_HCLKdiv1
  * 			@arg ETH_HCLKdiv2
  * 			@arg ETH_HCLKdiv4
  * 			@arg ETH_HCLKdiv8
  * 			@arg ETH_HCLKdiv16
  * 			@arg ETH_HCLKdiv32
  * 			@arg ETH_HCLKdiv64
  * 			@arg ETH_HCLKdiv128
  * @retval	None
  */
void ETH_BRGInit(uint32_t ETH_HCLKdiv)
{
	uint32_t tmpreg_ETH_CLOCK;

	/* Check the parameters */
	assert_param(IS_ETH_CLOCK_BRG(ETH_HCLKdiv));

	tmpreg_ETH_CLOCK = MDR_RST_CLK->ETH_CLOCK;
	tmpreg_ETH_CLOCK &= ~(RST_CLK_ETH_CLOCK_ETH_BRG_Msk);
	tmpreg_ETH_CLOCK |= ETH_HCLKdiv;

	MDR_RST_CLK->ETH_CLOCK = tmpreg_ETH_CLOCK;
}

/**
  * @brief	Enables or disables the specified ETHERNET clock.
  * @param	ETHx: Slect the number of ETHERNET interface.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_CLK1
  * 			@arg ETH_CLK2
  * @param	NewState: new state of the ETHERNET interface clock.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_ClockCMD(uint32_t ETHx, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ETH_CLK(ETHx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState == ENABLE){
		MDR_RST_CLK->ETH_CLOCK |= ETHx;
	}
	else{
		MDR_RST_CLK->ETH_CLOCK &= ~ETHx;
	}
}

/**
  * @brief	Reset the ETHERNETx peripheral registers to their default reset values.
  * @param	ETHERNETx: Slect the ETHERNET peripheral.
  *         This parameter can be one of the following values:
  *         MDR_ETHERNET1, MDR_ETHERNET2.
  * @retval	None
  */
void ETH_PHY_Reset(MDR_ETHERNET_TypeDef * ETHERNETx)
{
	/* Check the parameters */
	assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
	/* Reset PHY */
	ETHERNETx->PHY_Control &= ~ETH_PHY_CONTROL_nRST;

	/* Wait until the PHY unit did not come out in the state after a hard reset. */
	while(ETH_GetPHYStatus(ETHERNETx, ETH_PHY_FLAG_READY) != SET);
}

/**
  * @brief	Enables or disables the PHY.
  * @param	ETHERNETx: Slect the ETHERNET peripheral.
  *         This parameter can be one of the following values:
  *         MDR_ETHERNET1, MDR_ETHERNET2 for MDR1986VE3 and
  *         MDR_ETHERNET1 for MDR1986VE1T.
  * @param	NewState: new state of the PHY.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval	None
  */
void ETH_PHYCmd(MDR_ETHERNET_TypeDef * ETHERNETx, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

